{"input": {"plain": "I want to talk about a special gift I gave to my younger sister for her birthday last year. She had been admiring a beautiful handmade necklace in a local boutique for months but couldn't afford it. Knowing how much she loved it, I decided to save money from my part-time job to buy it for her. The necklace was elegant and delicate, with a small silver pendant shaped like a butterfly. When I presented it to her on her birthday, she was absolutely thrilled and couldn't stop smiling. She immediately put it on and kept touching it gently, as if to make sure it was real. What made this gift particularly meaningful was that it showed my sister how well I understood her taste and how much I cared about her happiness. Even now, whenever she wears the necklace, she tells me how much she appreciates it and how it reminds her of our special bond. Giving this gift made me realize that the best presents aren't necessarily the most expensive ones, but those that come from truly knowing and understanding the recipient.", "pause_count": 14, "pause_total": 8.25, "errors": []}, "output": {"score": "5.0-5.5", "explanation": "基本能完成表达，但语法、词汇或流利度均需加强；语速与停顿自然；语法错误极少。"}}
{"input": {"plain": "I'd like to talk about a charming little bakery called 'Sweet Haven' in my neighborhood. This family-run business has become incredibly popular due to its authentic French pastries and warm atmosphere. What makes it remarkable is how the owners transformed a small space into a thriving enterprise through dedication and innovation. They source local ingredients whenever possible, which not only supports nearby farmers but also ensures outstanding quality. The bakery specializes in artisanal bread and exquisite desserts, particularly their signature croissants that are perfectly flaky and buttery. Despite being relatively new, they've established a loyal customer base through excellent service and consistent quality. I remember when they first introduced their seasonal fruit tarts last summer - the combination of fresh berries and delicate pastry cream was absolutely divine. Their success stems from understanding customer preferences while maintaining high standards. Furthermore, they've cleverly expanded by offering baking classes on weekends, which attracts enthusiasts and generates additional revenue. The owners' passion is evident in every detail, from the rustic decor to the handwritten menu boards. This delightful bakery demonstrates how a small business can flourish through creativity, quality products, and genuine customer connections.", "pause_count": 18, "pause_total": 12.34, "errors": []}, "output": {"score": "6.0-6.5", "explanation": "整体表现尚可，能够较清晰表达观点，但仍有提升空间；停顿略多，可练习衔接；语法错误极少。"}}
{"input": {"plain": "I want to talk about when I helped organize a charity event at my university last semester. It was quite challenging because we had limited time and resources, but our team worked really hard. First, we had to find sponsors who would donate money and prizes for our raffle. Then we needed to promote the event through social media and posters around campus. The most difficult part was coordinating all the volunteers because everyone had different schedules. However, when the day finally came, everything went surprisingly well. We raised over 5,000 dollars for children's education in rural areas, which was much more than we expected. Seeing so many students and teachers come together for a good cause made me feel extremely proud. Although it was stressful at times, I learned valuable skills like teamwork and problem-solving. This experience showed me that even small efforts can make a big difference when people work together towards a common goal.", "pause_count": 15, "pause_total": 8.75, "errors": []}, "output": {"score": "5.0-5.5", "explanation": "基本能完成表达，但语法、词汇或流利度均需加强；语速与停顿自然；语法错误极少。"}}
{"input": {"plain": "I'd like to discuss my smartphone, which has become an indispensable tool in my daily life. This sophisticated device serves multiple purposes, from communication to productivity, making it incredibly versatile. Initially, I underestimated its potential, but gradually I discovered numerous applications that enhanced my efficiency. For instance, the calendar function helps me organize my schedule meticulously, while note-taking apps allow me to jot down ideas instantaneously. Moreover, the smartphone's GPS feature has proven invaluable when navigating unfamiliar areas, eliminating the stress of getting lost. What impresses me most is its seamless integration with other devices, enabling me to access files across platforms effortlessly. Although some argue that smartphones can be distracting, I've found that with disciplined usage, they significantly improve time management. The camera quality is another remarkable aspect, allowing me to capture high-resolution photos without carrying separate equipment. Furthermore, mobile banking apps provide convenient financial management, reducing the need for physical bank visits. This compact yet powerful technology has fundamentally transformed how I work, communicate, and entertain myself, demonstrating how innovation can simplify modern life.", "pause_count": 18, "pause_total": 14.32, "errors": []}, "output": {"score": "7.0-7.5", "explanation": "表达流畅自然，能充分展开话题；词汇丰富准确；语法结构多样；停顿合理自然。"}}
{"input": {"plain": "One outdoor activity I particularly relish is hiking in mountainous regions, which combines physical exertion with breathtaking natural beauty. Last summer, I embarked on an exhilarating trek through the Scottish Highlands, where the rugged terrain and unpredictable weather presented both challenges and rewards. The initial ascent was physically demanding, yet the panoramic vistas from each summit made every strenuous step worthwhile. What makes hiking truly captivating is its dual nature - it's simultaneously meditative and adventurous. While traversing through ancient pine forests, I often find myself completely immersed in the tranquil surroundings, yet the activity also requires careful navigation and problem-solving when encountering unexpected obstacles like sudden rockfalls or changing weather patterns. The camaraderie among fellow hikers creates a wonderful sense of community, as we share supplies, exchange route suggestions, and occasionally assist each other through difficult sections. One memorable incident occurred when our group encountered a family struggling with a steep incline; by combining our ropes and expertise, we helped them ascend safely, which was immensely gratifying. Beyond the physical benefits, hiking has taught me valuable lessons about perseverance, as reaching each peak requires sustained effort despite fatigue or discomfort. The activity also fosters deep environmental appreciation, as witnessing pristine landscapes firsthand reinforces the importance of conservation efforts. Whether it's the crisp morning air, the scent of damp earth after rainfall, or the spectacular sunset views from high altitudes, hiking engages all senses in a profoundly enriching experience that I find both invigorating and spiritually rewarding.", "pause_count": 18, "pause_total": 14.32, "errors": []}, "output": {"score": "7.0-7.5", "explanation": "表达流畅自然，能充分展开话题；词汇丰富准确；语法结构多样；停顿合理自然；极少错误。"}}
{"input": {"plain": "I vividly remember making a solemn promise to my younger sister last summer that I would help her prepare for her university entrance exams. As her elder sibling, I felt a profound responsibility to guide her through this pivotal academic challenge. Initially, she was overwhelmed by the extensive syllabus and lacked effective study strategies. I meticulously designed a comprehensive study plan, allocating specific time slots for each subject while incorporating regular breaks to maintain productivity. Furthermore, I demonstrated various memorization techniques and problem-solving approaches that had proven successful during my own exam preparation. Despite my busy work schedule, I religiously dedicated two hours every evening to tutoring her, patiently explaining complex concepts until she fully grasped them. What made this commitment particularly meaningful was witnessing her gradual transformation from an anxious student to a confident learner. When she finally aced her exams with outstanding results, the overwhelming pride and joy we both felt was indescribable. This experience not only strengthened our sibling bond but also reinforced my belief in the power of dedication and keeping one's word.", "pause_count": 18, "pause_total": 14.32, "errors": []}, "output": {"score": "7.0-7.5", "explanation": "表达流畅自然，能充分展开话题；用词准确多样，句式结构丰富；停顿合理，衔接自然；语法错误极少。"}}
{"input": {"plain": "I want to talk about my smartphone, which is an incredibly useful piece of technology. First of all, it helps me stay connected with my family and friends through social media and messaging apps. Although I sometimes spend too much time on it, the convenience is undeniable. Moreover, my smartphone serves as a powerful tool for learning because I can access educational apps and online courses whenever I want. For instance, I recently used it to study English grammar through a language app, which was quite helpful. Additionally, the camera quality is impressive, allowing me to capture precious moments with high clarity. While some people argue that smartphones are distracting, I believe they're essential in modern life as long as we use them wisely. The only drawback is the battery life, which could be better, but overall it's a device I couldn't live without.", "pause_count": 15, "pause_total": 8.75, "errors": []}, "output": {"score": "5.0-5.5", "explanation": "基本能完成表达，但语法、词汇或流利度均需加强；语速与停顿自然；语法错误极少。"}}
{"input": {"plain": "I'd like to share an invaluable piece of advice my mentor gave me during a challenging period in my academic journey. When I was struggling with time management between university studies and part-time work, my professor wisely suggested implementing the 'Pomodoro Technique' - a structured approach involving focused work intervals followed by short breaks. Initially skeptical, I gradually recognized the profound impact of this method as it not only enhanced my productivity but also reduced stress levels significantly. What made this advice particularly transformative was its emphasis on quality rather than quantity of study time, a perspective I'd previously overlooked. By dividing tasks into manageable segments and incorporating regular mental refreshment, I noticed remarkable improvements in both concentration and retention. Furthermore, this strategy taught me the importance of work-life balance, enabling me to allocate time for personal development and relaxation without compromising academic performance. The most compelling aspect was witnessing tangible results - my grades improved by nearly 20% within two months of implementation. This experience fundamentally altered my approach to time management and productivity, lessons I continue to apply in both professional and personal spheres. The advice proved not merely useful but truly life-changing, demonstrating how simple yet strategic adjustments can yield extraordinary outcomes.", "pause_count": 18, "pause_total": 14.32, "errors": []}, "output": {"score": "7.0-7.5", "explanation": "表达流畅自然，能充分展开话题；词汇丰富准确；语法结构多样；停顿合理自然；内容充实有逻辑。"}}
{"input": {"plain": "I'd like to discuss my smartphone, which has become an indispensable tool in my daily life. This sophisticated device serves multiple purposes beyond mere communication - it functions as my personal organizer, entertainment hub, and learning platform. What makes it particularly remarkable is its seamless integration of various applications that enhance productivity. For instance, I use calendar apps to schedule meetings, language learning apps to improve my English, and fitness trackers to monitor my health. The most impressive feature is its artificial intelligence capability that suggests optimal routes when I'm navigating or reminds me of important tasks. Although some argue that smartphones create dependency, I find mine liberating as it allows me to work remotely and stay connected with family abroad. The convenience of having a powerful computer in my pocket has fundamentally transformed how I manage both professional and personal matters.", "pause_count": 12, "pause_total": 8.75, "errors": []}, "output": {"score": "7.0-7.5", "explanation": "表达流畅自然，能清晰阐述观点；词汇丰富准确；语法结构多样；停顿合理自然。"}}
{"input": {"plain": "One photograph that holds special significance for me was taken during my graduation ceremony last summer. The vibrant image captures me standing proudly in my academic regalia, with the majestic university building as our breathtaking backdrop. What makes this picture particularly meaningful is the genuine expression of accomplishment radiating from my face, complemented by the warm sunlight filtering through the ancient oak trees. My parents flank me on either side, their faces beaming with unmistakable pride, while my best friend snapped the photo at just the perfect moment. The composition is striking - the contrast between the formal graduation attire and the casual, joyful poses creates a delightful visual balance. Moreover, this image symbolizes not just the culmination of years of arduous study, but also the unwavering support system that carried me through challenging times. Whenever I glance at this photograph, I'm instantly transported back to that euphoric day filled with celebratory speeches, heartfelt congratulations, and optimistic discussions about future endeavors. It serves as a tangible reminder that perseverance yields rewards and that cherished moments deserve to be immortalized.", "pause_count": 14, "pause_total": 11.2, "errors": []}, "output": {"score": "7.0-7.5", "explanation": "表达清晰流畅，能充分展开话题；词汇丰富准确，句式多样；停顿自然合理，完全不影响理解；语法错误极少。"}}
{"input": {"plain": "I'd like to discuss a particularly irritating advertisement I encountered recently for a weight loss product. The commercial was excessively repetitive, airing multiple times during my favorite TV show, which significantly disrupted my viewing experience. What I found most objectionable was its misleading claims, promising unrealistic results like losing 10kg in just two weeks without any exercise. The ad featured overly enthusiastic testimonials from so-called customers who appeared suspiciously similar to actors. Moreover, the background music was annoyingly loud and repetitive, making it impossible to ignore. While I understand advertising needs to capture attention, this crossed into aggressive manipulation. The worst part was how it preyed on people's insecurities by showing exaggerated before-and-after images. Although the product might have some merit, the deceptive marketing tactics completely put me off. This experience made me more critical of advertisements in general, especially those making extraordinary health claims.", "pause_count": 14, "pause_total": 10.2, "errors": []}, "output": {"score": "6.0-6.5", "explanation": "整体表现尚可，能够较清晰表达观点，但仍有提升空间；停顿略多，可练习衔接；语法错误极少。"}}
{"input": {"plain": "I vividly remember making a solemn promise to my younger sister last year that I would help her prepare for her final exams. She was struggling with mathematics, a subject I had always excelled in, and her anxiety was palpable. I committed to tutoring her three times a week, despite my own hectic university schedule. The initial sessions were challenging as we had to bridge significant gaps in her understanding. However, through patient explanation and creative teaching methods, we gradually built her confidence. What made this commitment particularly demanding was that it coincided with my midterm examinations. There were moments when I felt overwhelmed, yet I persevered because I valued the trust she had placed in me. We developed a structured study plan, focusing on problem areas while incorporating regular reviews of previously covered material. The turning point came when she solved a complex algebra problem independently - her triumphant smile was immensely rewarding. When her results were finally released, she had not only passed but achieved a distinction, which was beyond our initial expectations. This experience taught me the profound satisfaction that comes from honoring commitments and the transformative power of dedicated mentorship.", "pause_count": 16, "pause_total": 12.8, "errors": []}, "output": {"score": "6.0-6.5", "explanation": "整体表现尚可，能够较清晰表达观点，但仍有提升空间；停顿略多，可练习衔接；语法错误极少。"}}
{"input": {"plain": "Okay, well this was a really tricky topic because there's so many inventions and innovations that have changed the world. There's computers, the internet, credit cards, virtual money. It was really difficult actually to choose just one of them, but in reflection I think the biggest and most significant invention to have changed the world is social media. I mean if you look at Facebook and Twitter and those kinds of platforms, there's no doubt that they've had a huge profound impact on our lives. And the good thing is that with the coming of a global world we're now able to communicate with friends and family across the world instantly. I mean I think that's wonderful. And also just for things like birthdays, that's really handy to have as well just to be updated with things like that. But I just wonder if in reflection if the disadvantages and drawbacks to social media are on our weighing the benefits. So if you think about them who are posted things online and you know comments and photographs and then as they get older they suddenly regret that picture of themselves being up there. So yeah I think there's definitely disadvantages. Also it can just be used as a platform for people to get at each other. So attacking politicians or bullies at school or celebrities based on something that they've said. So yeah and then there's the playing around with our personal information to manipulate political elections. I mean that is frightening.","pause_count": 74,"pause_total": 47.98,"errors": []},"output": {"score": "8.5-9.0","explanation": "整体表达接近母语水平，发音清晰自然，词汇与语法多样且准确，观点连贯、逻辑清晰。保持现有水平的同时，可进一步在细节展开和语音情感层面精进。 (停顿 74 次 / 47.98 秒)"}}
{"input": {"plain": "One of my favorite books is The Little Prince by Antoni Decent X-Hopory I first read it in high school and even so it's a children's book It made me think deeply about life The story is about young prince who travels from planet to planet Many different characters lacking, a woman and a lamp lighter Each encounter teaches him something about human nature My favorite part was when he made the books Who taught him what is an encyclopedia in this book to the eye At first I didn't understand but later I realized it meant that love and friendship are more valuable than my own I love this book because it's simple but for freedom So illustration was also beautiful I still remember the joint of the boy, the constrictor, swallowing, swallowing and elephant After finishing it I recommend the airy common did it to my best friend and they even discussed the mean of some cult gather Now whenever I feel confused about life I read The Little Prince It reminds me to appreciate the small things and not to love my inner child I think everyone should read it at last at least once", "pause_count": 70, "pause_total": 47.38, "errors": []}, "output": {"score": "4.5-5.0","explanation": "表达内容可理解但流利度受限，词汇和语法较为简单，错误较多。建议加强主题词汇积累，练习复杂句式，并通过跟读与复述提高流畅度。 (停顿 70 次 / 47.38 秒)"}}
{"input": {"plain": "I'd like to talk about my middle school my teacher, Mr. B. It wasn't just a teacher to me, it was someone who changed a way of singing the song before I met him, I heard my song, it was too difficult and I always gave up that I couldn't serve the poem, but Mr. Lee had a special way of teaching. Instead of just writing formulas on the board, he used real-life examples to explain for instance, he taught friction by cutting an apple into pieces and he made a geometry fun by asking us to mirror objects in the classroom. One day, after I felt attached, he called me to his office. I thought he would scold me, but instead he said, mistakes are part of learning. Let's see where you went wrong, he spent an hour going through each problem with me patiently. He also told me, math isn't about being fast, it's about being careful. Math isn't about being fast, it's about being careful. Sixth to him, a start, a start, a start, practicing little everyday. Stully, my grades improved and I even began to enjoy some problems. More importantly, I learned that her work and patience can overcome any difficulty. Now, whenever I faced the situation, I remember his words, I will always be grateful to Mr. Lee for teaching me not just math, but also a valuable life lesson.", "pause_count": 63, "pause_total": 50.88, "errors": []}, "output": {"score": "4.5-5.0","explanation": "表达内容可理解但流利度受限，词汇和语法较为简单，错误较多。建议加强主题词汇积累，练习复杂句式，并通过跟读与复述提高流畅度。 (停顿 63 次 / 50.88 秒)"}}
{"input": {"plain": "I want to talk about a beach. I visited last summer. It was in San-Yan, a city in China. The beach was very beautiful with white sand and blue water. The weather was suddenly unwarmed, perfect for swimming. I went there with my family, stayed for three years, three days. I morning, we walked on the beach. And in the afternoon, we swim in the sea. I also tried surfing for the first time. But it was difficult. At night, we ate seafood as a restaurant near the beach. I liked this place because it was relaxing and fun. The night was beautiful. And I felt happy there. I hope I can go back again by day. And I felt happy there. I hope I can go back again one day.", "pause_count": 46, "pause_total": 32.94, "errors": []}, "output": {"score": "5.0-5.5","explanation": "表达内容可理解但流利度受限，词汇和语法较为简单，错误较多。建议加强主题词汇积累，练习复杂句式，并通过跟读与复述提高流畅度。 (停顿 46 次 / 32.94 秒)"}}
{"input": {"plain": "Okay, I will talk about time. Well, I helped my friend. Last year my friend Lisa had a problem with her homework. She didn't understand my questions and she was very worried because the exam comes soon. And I'm good at my so I decided to help her. I ran after her in the school. We started together. I explained the problem that by step and I gave her some examples. At first, she first confused but after a few days she started to understand. She was very happy and I felt good because I could help her. But I didn't. She passed a exam and she seemed to me a lot. I was proud of myself because my help was useful. Helping others is a nice feeling. And I think everyone should try to help people once they can.", "pause_count": 38, "pause_total": 24.7, "errors": []}, "output": {"score": "5.0-5.5","explanation": "表达内容可理解但流利度受限，词汇和语法较为简单，错误较多。建议加强主题词汇积累，练习复杂句式，并通过跟读与复述提高流畅度。 (停顿 38 次 / 24.70 秒)"}}
{"input": {"plain": "Let me tell you about the pieces of my... I had three major exams, most English and history. I was in the same week and you it will be so but I didn't expect it to be that ex-housing. My rule line was crazy. I woke up at 6 am every day, revealed no storing breakfast in the middle of the school. After classes, I stayed in the library until it closed at 9 pm. I barely had time to eat properly just sandwich or instant noodles. Even my friends noticed I looked tired because I had dark circles out of my eyes. The worry part was the lick of the lick. I already slept only 4 to 5 hours a night. One time I fell asleep while studying and woke up with my fish on the textbook. My mom kept telling me to take breaks. But I was too stressed. I kept thinking what if I fail. Families examined me. I got my results. I was surprised. I passed my exam and my history grade was in better than expected. Looking back, I realized I should have planned my time better instead of planning everything at the last minute. Now, I try to study a little area to avoid that kind of stress again.", "pause_count": 57, "pause_total": 39.6, "errors": []}, "output": {"score": "5.0-5.5","explanation": "表达内容可理解但流利度受限，词汇和语法较为简单，错误较多。建议加强主题词汇积累，练习复杂句式，并通过跟读与复述提高流畅度。 (停顿 57 次 / 39.60 秒)"}}
